Catalogs/фин_СтатьиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_СтатьиБюджета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтрокиБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакВнутригрупповогоОборота</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ТипыВнутригрупповыхОборотовПоБюджету</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяФункция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ИтоговыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьИзИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаКоличество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРасчетыТолькоДляПервоначальногоЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастотаВыполненияРасчетовПоФормулам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ЧастотаВыполненияРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыполненияРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатораСтатей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_КлассификаторСтатейБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗнакКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знак</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДолжностнымОкладом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетнойтаблицы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.б_ВидыРасчетныхТаблиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетнойтаблицыДляВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.б_ВидыРасчетныхТаблиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКПВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНаКазахскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория1Уровня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория2Уровня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подкласс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныПроводок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.фин_Бюджетирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.фин_Бюджетирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДляСуммы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДляКоличества</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_ЧастотаВыполненияРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ЧастотаВыполненияРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПервомПериоде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПоследнемПериоде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СУказаннойПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СУказаннойПериодичностьюВКонцеПериода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ВидыСтрокБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыСтрокБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываемаяПоМодели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываемаяПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываемаяПоЗависимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываемаяПоОстаткам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследуемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Итоговая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИерархияБюджета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываемаяПоНесколькимИсточникамРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываемаяПоМоделиВПредшествующихБюджетах</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_Бюджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_Бюджеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникПроектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСортировкиСтатей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСортировкиСтатейПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКодыСтрокБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДетализацииБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_УровниДетализацииБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяПодчиненныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимыРасчетаИтоговойСтрокиБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РежимыРасчетаИтоговойСтрокиБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяФункция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ИтоговыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСумме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоКоличеству</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНастройкаИтоговПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноФормированиеНаОснованииПлановЗакупок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноФормированиеНаОснованииПлановДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьКоличественныхПоказателей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаКоличество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяНачальныхОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКонечныхОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦС_РасчетНеНакоплением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/фин_СтатьиБюджета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФинансовыйПоказательПриИзменении(Элемент)
	//Если Объект.Наименование="" Тогда
	//	Объект.Наименование = Строка(Объект.ФинансовыйПоказатель);
	//	ОбновитьПредставлениеРасчетов();
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеРасчетов()
	ВидСтрокиБюджета = Справочники.фин_ФинансовыеПоказатели.ВидРасчетнойСтроки(Объект.ФинансовыйПоказатель,Объект.Владелец);
	Элементы.ДекорацияРасчетыПредставление.Заголовок = фин_ОбщегоНазначенияКлиентСервер.ПредставлениеНастроекРасчетов(Объект.ФинансовыйПоказатель,Истина,ВидСтрокиБюджета)
			+?(ЗначениеЗаполнено(Объект.ЧастотаВыполненияРасчетовПоФормулам),
			Символы.ПС + "Расчет производится: "+Строка(Объект.ЧастотаВыполненияРасчетовПоФормулам)+?(Объект.ЧастотаВыполненияРасчетовПоФормулам=ПредопределенноеЗначение("Перечисление.фин_ЧастотаВыполненияРасчетов.СУказаннойПериодичностью"),": "+Строка(Объект.ПериодичностьВыполненияРасчетов),""),
			"");
	Элементы.ДекорацияИтогиПредставление.Заголовок = "Расчет итогов: "+фин_ОбщегоНазначенияКлиентСервер.ПредставлениеНастроекИтогов(Объект,Истина);
	Элементы.ИспользоватьРасчетыТолькоДляПервоначальногоЗаполнения.Видимость = НЕ (ВидСтрокиБюджета = Перечисления.фин_ВидыСтрокБюджета.РассчитываемаяПоМоделиВПредшествующихБюджетах ИЛИ ВидСтрокиБюджета = Перечисления.фин_ВидыСтрокБюджета.Наследуемая ИЛИ ВидСтрокиБюджета = Перечисления.фин_ВидыСтрокБюджета.РассчитываемаяПоЗависимости ИЛИ ВидСтрокиБюджета = Перечисления.фин_ВидыСтрокБюджета.РассчитываемаяПоНесколькимИсточникамРасчета);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НадписьПараметрыСтатьиБюджета = "Параметры статьи бюджета";
	ОбновитьПредставлениеРасчетов();
	Элементы.ДекорацияИтогиПредставление.Видимость = Справочники.фин_Бюджеты.РазличныеНастройкиИтоговВСтатьяхБюджета(Объект.Владелец);
	Элементы.Версия.Видимость = Справочники.фин_Бюджеты.ВерсионированиеБюджетаИспользуется(Объект.Владелец);
КонецПроцедуры

&НаКлиенте
Процедура РасчетыПредставлениеНажатие(Элемент)
	ПараметрыНастройкаРасчетов = Новый Структура("УчетПоСумме,УчетПоКоличеству,ЭтоГруппа,Формула,ФормулаКоличество,ТолькоДляПлановыхДанных,ПоРасценкам,
												|ОтносительныйПоказатель,ПризнакПеретекающегоОстатка,ВидПоказателя,ЧастотаВыполненияРасчетовПоФормулам,
												|ПериодичностьВыполненияРасчетов,ИспользоватьРасчетыТолькоДляПервоначальногоЗаполнения");
	ЗаполнитьЗначенияСвойств(ПараметрыНастройкаРасчетов,Объект);
	ЗаполнитьЗначенияСвойств(ПараметрыНастройкаРасчетов,ХарактеристикиФинансовогоПоказателя(Объект.ФинансовыйПоказатель));
	//ПараметрыНастройкаРасчетов.Вставить("ВидПоказателя",ПолеОбъекта(Объект.ФинансовыйПоказатель,"ВидПоказателя"));
	//ПараметрыНастройкаРасчетов.Вставить("ПризнакПеретекающегоОстатка",ПолеОбъекта(Объект.ФинансовыйПоказатель,"ПризнакПеретекающегоОстатка"));
	ПараметрыНастройкаРасчетов.Вставить("ТолькоПросмотр",Истина);
	ПараметрыНастройкаРасчетов.Вставить("ВидСтрокиБюджета",ВидСтрокиБюджета);
	ОткрытьФорму("Обработка.фин_УправлениеСтруктуройБюджета.Форма.ФормаНастройкиРасчетов",ПараметрыНастройкаРасчетов,ЭтотОбъект,УникальныйИдентификатор,?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,Окно),,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХарактеристикиФинансовогоПоказателя(ФинансовыйПоказатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_ФинансовыеПоказатели.УчетПоСумме,
		|	фин_ФинансовыеПоказатели.УчетПоКоличеству,
		|	фин_ФинансовыеПоказатели.Формула,
		|	фин_ФинансовыеПоказатели.ФормулаКоличество,
		|	фин_ФинансовыеПоказатели.ТолькоДляПлановыхДанных,
		|	фин_ФинансовыеПоказатели.ПоРасценкам,
		|	фин_ФинансовыеПоказатели.ОтносительныйПоказатель,
		|	фин_ФинансовыеПоказатели.ПризнакПеретекающегоОстатка,
		|	фин_ФинансовыеПоказатели.ВидПоказателя
		|ИЗ
		|	Справочник.фин_ФинансовыеПоказатели КАК фин_ФинансовыеПоказатели
		|ГДЕ
		|	фин_ФинансовыеПоказатели.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ФинансовыйПоказатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	Структура = Новый Структура;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Структура.Вставить(Колонка.Имя);
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Структура;

КонецФункции

&НаСервереБезКонтекста
Функция ПолеОбъекта(Показатель,Поле)
	 возврат Показатель[Поле];
КонецФункции

&НаКлиенте
Процедура ДекорацияИтогиПредставлениеНажатие(Элемент)
	ОписаниеОповещенияНастройкаИтогов = Новый ОписаниеОповещения("ОбработатьНастройкуИтогов",ЭтотОбъект);
	ПараметрыНастройкаИтогов = Новый Структура("ИтоговаяФункция,ИсключитьИзИтогов,ПризнакВнутригрупповогоОборота,РучнаяНастройкаИтоговПоГруппам");
	ЗаполнитьЗначенияСвойств(ПараметрыНастройкаИтогов,Объект);
	ОткрытьФорму("Обработка.фин_УправлениеСтруктуройБюджета.Форма.ФормаНастройкиИтогов",ПараметрыНастройкаИтогов,ЭтотОбъект,УникальныйИдентификатор,?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,Окно),,ОписаниеОповещенияНастройкаИтогов,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНастройкуИтогов(РезультатВыбора,ДополнительныеПараметры) Экспорт 
	Если РезультатВыбора<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект,РезультатВыбора);
		ОбновитьПредставлениеРасчетов();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
